01_ahmed_body_validation/simulations/openfoam/case_25deg/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v13                                   |
|   \\  /    A nd           | Website:  www.openfoam.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1.78;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1.78;
    }
    outlet
    {
        type            zeroGradient;
    }
    ground
    {
        type            omegaWallFunction;
        value           uniform 1.78;
    }
    topAndSides
    {
        type            slip;
    }
    ahmedBody
    {
        type            omegaWallFunction;
        value           uniform 1.78;
    }
}

// ************************************************************************* //
