01_ahmed_body_validation/simulations/openfoam/case_25deg/system/fvSolution
FoamFile { version 2.0; format ascii; class dictionary; object fvSolution; }
solvers { p { solver GAMG; tolerance 1e-6; relTol 0.1; smoother GaussSeidel; } "(U|k|omega)" { solver smoothSolver; smoother symGaussSeidel; tolerance 1e-6; relTol 0.1; } }
SIMPLE { nNonOrthogonalCorrectors 0; consistent yes; pRefCell 0; pRefValue 0; }
relaxationFactors { equations { U 0.9; k 0.9; omega 0.9; } }
